# Напишите программу вычисления арифметического выражения заданного строкой.
# Используйте операции +,-,/,*.
# Приоритет операций стандартный.
# Добавьте возможность использования скобок, меняющих приоритет операций

print('Результат:', eval(input('Задайте арифметическое выражение: ')))
